Autodesk.Revit.DB.SpatialElementFromToCalculationPoints.IsAcceptableToPosition(Autodesk.Revit.DB.XYZ)
Checks whether a given "to" position is valid.
Remarks:
The "from" position and the "to" position must be on opposite sides of the family's host.  Flipping the calculation
point will reverse the direction.
Returns:
True if the input is an acceptable "to" position and False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.SpatialElementFromToCalculationPoints.IsAcceptableFromPosition(Autodesk.Revit.DB.XYZ)
Checks whether a given "from" position is valid.
Remarks:
The "from" position and the "to" position must be on opposite sides of the family's host.  Flipping the calculation
point will reverse the direction.
Returns:
True if the input is an acceptable "from" position and False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.SpatialElementFromToCalculationPoints.MakeToPositionAcceptable(Autodesk.Revit.DB.XYZ)
This function takes a potential "to" point and converts it to be a similar point on the opposite side of the family's host from
the "from" point if necessary.
Remarks:
If the point is already an acceptable "to" location then the original point will be returned.  Otherwise, the point's
X and Y will be projected onto the centerline of the family's host.
newToLocation:
The desired "to" location
Returns:
The valid "to" location.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.SpatialElementFromToCalculationPoints.MakeFromPositionAcceptable(Autodesk.Revit.DB.XYZ)
This function takes a potential "from" point and converts it to be a similar point on the opposite side of the family's host from
the "to" point if necessary.
Remarks:
If the point is already an acceptable "from" location then the original point will be returned.  Otherwise, the point's
X and Y will be projected onto the centerline of the family's host.
newFromLocation:
The desired "from" location
Returns:
The valid "from" location.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.SpatialElementFromToCalculationPoints.ToPosition
The "to" position of spatial element connecting calculation point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: toPosition must be on the opposite side of the family's host from the "from" position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.SpatialElementFromToCalculationPoints.FromPosition
The "from" position of spatial element connecting calculation point.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: fromPosition must be on the opposite side of the family's host from the "to" position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2014